using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

//1.	Определить класс(в соответствии с вариантом) в новом файле(Файл –> Создать –> Класс C#). 
//2.	Определить в классе соответствующие поля и добавить поле типа DateTime.
//3.	Определить необходимые средства доступа (свойства). 
//4.	Реализовать все виды конструкторов.
//5.	Определить в классе соответствующие методы и добавить переопределенный метод ToString.
//6.	В основной программе создать объекты класса и продемонстрировать их работу.

namespace Lab
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
