#include <stdlib.h>
#include <iostream>
using namespace std;

//9. АТД - однонаправленный список с элементами типа char.Дополнительно перегрузить следующие операции :
//++ добавить элемент в конец(list + char);
//-- удалить элемент из конца(типа list--);
//!=  проверка на неравенство.
//Выбрать класс АТД в соответствии с вариантом.
//2. Определить и реализовать в классе конструкторы, деструктор, функции Input(ввод с клавиатуры) и Print(вывод на экран), перегрузить операцию присваивания.
//3. Написать программу тестирования класса и выполнить тестирование.
//4. Дополнить определение класса заданными перегруженными операциями(в соответствии с вариантом).
//5. Реализовать эти операции.Выполнить тестирование.
//Содержание

int main()
{

	system("pause");
	return 0;
}