

//Task
//В программе № 1 выполнить следующее :
//1. Создать объект - контейнер в соответствии с вариантом задания и заполнить его данными, тип которых определяется вариантом задания.
//2. Просмотреть контейнер.
//3. Изменить контейнер, удалив из него одни элементы и заменив другие.
//4. Просмотреть контейнер, используя для доступа к его элементам итераторы.
//5. Создать второй контейнер этого же класса и заполнить его данными того же типа, что и первый контейнер.
//6. Изменить первый контейнер, удалив из него n элементов после заданного и добавив затем в него все элементы из второго контейнера.
//7. Просмотреть первый и второй контейнеры.
//В программе № 2 выполнить то же самое, но для данных пользовательского типа.
//В программе № 3 выполнить следующее :
//1. Создать контейнер, содержащий объекты пользовательского типа.Тип контейнера выбирается в соответствии с вариантом задания.
//2. Отсортировать его по убыванию элементов.
//3. Просмотреть контейнер.
//4. Используя подходящий алгоритм, найти в контейнере элемент, удовлетворяющий заданному условию.
//5. Переместить элементы, удовлетворяющие заданному условию в другой(предварительно пустой) контейнер.Тип второго контейнера определяется вариантом задания.
//6. Просмотреть второй контейнер.
//7. Отсортировать первый и второй контейнеры по возрастанию элементов.
//2
//8. Просмотреть их.
//9. Получить третий контейнер путем слияния первых двух.
//10. Просмотреть третий контейнер.
//11. Подсчитать, сколько элементов, удовлетворяющих заданному условию, содержит третий контейнер.
//12. Определить, есть ли в третьем контейнере элемент, удовлетворяющий заданному условию.
//Variant 9
//9 - set - stack - int

//#include <iostream>
//#include <vector>
//using namespace std;
//
//void main()
//{
//	vector<int> v;
//	int i;
//	for (i = 0;i<10;i++)v.push_back(i);
//	cout << "size = " << v.size() << "\n";
//	for (i = 0;i<10;i++)cout << v[i] << " ";
//	cout << endl;
//	for (i = 0;i<10;i++)v[i] = v[i] + v[i];
//	for (i = 0;i<v.size();i++)cout << v[i] << " ";
//	cout << endl;
//	system("pause");
//}

int main()
{

	return 0;
}