
//Порядок выполнения работы :
//1.	Создать шаблон заданного класса.
//	Определить конструкторы, 
//	деструктор, перегруженную 
//	операцию присваивания(“ = ”) и
//	операции, заданные в варианте 
//	задания.
//2.	Написать программу тестирования,
//	в которой проверяется 
//	использование шаблона для
//	стандартных типов данных.
//3.	Выполнить тестирование.
//4.	Определить пользовательский
//	класс, который будет 
//	использоваться в качестве
//	параметра шаблона.Определить
//	в классе необходимые функции
//	и перегруженные операции.
//5.	Написать программу тестирования,
//	в которой проверяется 
//	использование шаблона 
//	для пользовательского типа.
//6.	Выполнить тестирование.
//7.	Добавить обработку 3 - 4 
//	исключительных ситуаций 
//	в обе программы.
//8.	Определить АТД всех шаблонов.
//9.	Выполнить тестирование.
//9. Класс множество set.
//Дополнительно перегрузить следующие
//операции :
//() конструктор множества
//(в стиле конструктора для 
//	множественного типа в языке
//	Pascal);
//+ объединение множеств;
//<=  сравнение множеств.

int main()
{

}